RP6conrad/ESP-GPS-Logger/ESP32FtpServerJH.cpp
/*
 * FTP Serveur for ESP8266
 * based on FTP Serveur for Arduino Due and Ethernet shield (W5100) or WIZ820io (W5200)
 * based on Jean-Michel Gallego's work
 * modified to work with esp8266 SPIFFS by David Paiva david@nailbuster.com
 * 
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
//  2017: modified by @robo8080
//  2019: modified by @HenrikSte
//  2021 : change so that timestamp file is working in ftp
//  20/02/2022 Changes for Android, FEAT command comes before login, null-pointer detection (crash if FEAT)
#include "ESP32FtpServerJH.h"
#include <WiFi.h>
#include <WiFiClient.h>
#include <FS.h>
#include "SD.h"
#include "SPI.h"
#include "SD_card.h"

//changes JH 20/02/2021, added for timestamp file ftp

String print_time(time_t timestamp) {
  //char message[120];
  char buff[20];
  strftime(buff, 20, "%Y%m%d%H%M%S", localtime(&timestamp));//was localtime
  return buff;
}

WiFiServer ftpServer( FTP_CTRL_PORT );
WiFiServer dataServer( FTP_DATA_PORT_PASV );

FtpServer::FtpServer()
{

}

void FtpServer::begin(String uname, String pword)
{
  // Tells the ftp server to begin listening for incoming connection
	_FTP_USER=uname;
	_FTP_PASS = pword;

  if(!SD.begin())
  {
      Serial.println("Card Mount Failed");
      return;
  }
  uint8_t cardType = SD.cardType();

  if(cardType == CARD_NONE){
      Serial.println("No SD card attached");
      return;
  }

  Serial.print("SD Card Type: ");
  if(cardType == CARD_MMC){
      Serial.println("MMC");
  } else if(cardType == CARD_SD){
      Serial.println("SDSC");
  } else if(cardType == CARD_SDHC){
      Serial.println("SDHC");
  } else {
      Serial.println("UNKNOWN");
}

	ftpServer.begin();
	delay(10);
	dataServer.begin();	
	delay(10);
	millisTimeOut = (uint32_t)FTP_TIME_OUT * 60 * 1000;
	millisDelay = 0;
	cmdStatus = 0;
  iniVariables();
}

void FtpServer::iniVariables()
{
  // Default for data port
  dataPort = FTP_DATA_PORT_PASV;
  
  // Default Data connection is Active
  dataPassiveConn = true;
  
  // Set the root directory
  strcpy( cwdName, "/" );

  rnfrCmd = false;
  transferStatus = 0;
  
}

int FtpServer::handleFTP()
{
  if((int32_t) ( millisDelay - millis() ) > 0 )
    return 0;

  if (ftpServer.hasClient()) {
//  if (ftpServer.available()) {
	  client.stop();
	  client = ftpServer.available();
  }
  
  if( cmdStatus == 0 )
  {
    if( client.connected())
      disconnectClient();
    cmdStatus = 1;
  }
  else if( cmdStatus == 1 )         // Ftp server waiting for connection
  {
    abortTransfer();
    iniVariables();
    #ifdef FTP_DEBUG
	  Serial.println("Ftp server waiting for connection on port "+ String(FTP_CTRL_PORT));
    #endif
    cmdStatus = 2;
  }
  else if( cmdStatus == 2 )         // Ftp server idle
  {	
    if( client.connected() )                // A client connected
    {
      clientConnected();      
      millisEndConnection = millis() + 10 * 1000 ; // wait client id during 10 s.
      cmdStatus = 3;
    }
  }
  else if( readChar() > 0 )         // got response
  {				
    if( cmdStatus == 3 ){ 	// Ftp server waiting for user identity
      if( feat())			//With Android FTP, FEAT command comes before login !!
        cmdStatus = 3;
      else if (userIdentity()) cmdStatus = 4;
			else cmdStatus=0;
	 
	  }
    else if( cmdStatus == 4 )      // Ftp server waiting for user registration    
	 if( userPassword() )
		  {
			cmdStatus = 5;
			millisEndConnection = millis() + millisTimeOut;
		  }
     else cmdStatus = 0;
    else if( cmdStatus == 5 )      
		{
		  if( ! processCommand())
			cmdStatus = 0; 
		  else
			millisEndConnection = millis() + millisTimeOut;
		}
	}
  else if (!client.connected() || !client)
  {
	  cmdStatus = 1;
      #ifdef FTP_DEBUG
	    Serial.println("client disconnected");
	  #endif
  }

  if( transferStatus == 1 )         // Retrieve data
  {
    if( ! doRetrieve())
      transferStatus = 0;
  }
  else if( transferStatus == 2 )    // Store data
  {
    if( ! doStore())
      transferStatus = 0;
  }
  else if( cmdStatus > 2 && ! ((int32_t) ( millisEndConnection - millis() ) > 0 ))
  {
	  client.println("530 Timeout");
    millisDelay = millis() + 200;    // delay of 200 ms
    cmdStatus = 0;
  }


  return    transferStatus!=0
         || cmdStatus     !=0;
}

void FtpServer::clientConnected()
{
  #ifdef FTP_DEBUG
	Serial.println("Client connected!");
  #endif
  client.println( "220--- Welcome to FTP for ESP32 ---");
  client.println( "220--- By David Paiva + JH  ---");
  client.println( "220 --   Version "+ String(FTP_SERVER_VERSION) +"   --");
  iCL = 0;
}

void FtpServer::disconnectClient()
{
  #ifdef FTP_DEBUG
	Serial.println(" Disconnecting client");
  #endif
  abortTransfer();
  client.println("221 Goodbye");
  client.stop();
}
boolean FtpServer::feat()				//With Android FTP, FEAT comes before login !!!
{	
if( ! strcmp( command, "FEAT" ))
  {
    client.println( "211-Extensions suported:");
    client.println( " MLSD");
	client.println( " MLST type*;modify*;size*;");
    client.println( "211 End.");
	return true;
  }
return false;  
}
boolean FtpServer::userIdentity()
{	
  if( strcmp( command, "USER" ))
    client.println( "500 Syntax error");
  if(parameters)		//check for nullpointer jh
	{
	  if( strcmp( parameters, _FTP_USER.c_str() ))
		client.println( "530 user not found");
	  else
	  {
		client.println( "331 OK. Password required");
		strcpy( cwdName, "/" );
		return true;
	  }
	}
  millisDelay = millis() + 100;  // delay of 100 ms
  return false;
}

