RP6conrad/ESP-GPS-Logger/ESP32FtpServerJH.cpp
boolean FtpServer::userPassword()
{
if(parameters){							//checking for null pointer jh
  if( strcmp( command, "PASS" ))
    client.println( "500 Syntax error");
  else if( strcmp( parameters, _FTP_PASS.c_str() ))
    client.println( "530 ");
  else
  {
    #ifdef FTP_DEBUG
      Serial.println( "OK. Waiting for commands.");
    #endif
    client.println( "230 OK.");
    return true;
  }
  millisDelay = millis() + 100;  // delay of 100 ms
  return false;
}
else Serial.println("Nullpointer detected password");
return false;
}
boolean FtpServer::processCommand()
{
  ///////////////////////////////////////
  //                                   //
  //      ACCESS CONTROL COMMANDS      //
  //                                   //
  ///////////////////////////////////////
  if( ! strcmp( command, "SYST" ))	//Android devices ask for System
	  {   
		  client.println( "215 UNIX Type: L8");
	  }
  //
  //  CDUP - Change to Parent Directory 
  //
  else if( ! strcmp( command, "CDUP" ))
  {
    //int todo;
	  client.println("250 Ok. Current directory is \"" + String(cwdName) + "\"");
  }
  //
  //  CWD - Change Working Directory
  //
  else if( ! strcmp( command, "CWD" ))
  {
    if( strcmp( parameters, "." ) == 0 )  // 'CWD .' is the same as PWD command
      client.println( "257 \"" + String(cwdName) + "\" is your current directory");
    else 
      {      

        #ifdef FTP_DEBUG
        Serial.print("CWD P=");
        Serial.print(parameters);
        Serial.print(" CWD=");
        Serial.println(cwdName);
        #endif
        String dir;

        if (parameters[0]=='/')
        {
          dir = parameters;
        }
        else if (!strcmp(cwdName,"/")) // avoid "\\newdir"
        {
          dir = String("/") + parameters;
        }
        else
        {
          dir = String(cwdName) +"/" + parameters;
        }        

        if (SD.exists(dir))
        {
          strcpy(cwdName, dir.c_str());
          client.println( "250 CWD Ok. Current directory is \"" + String(dir) + "\"");
          Serial.println( "250 CWD Ok. Current directory is \"" + String(dir) + "\"");
        }
        else
        {
          client.println( "550 directory or file does not exist \"" + String(parameters) + "\"");
          Serial.println( "550 directory or file does not exist \"" + String(parameters) + "\"");
        }
      }
    
  }
  //
  //  PWD - Print Directory
  //
  else if( ! strcmp( command, "PWD" ))
    client.println( "257 \"" + String(cwdName) + "\" is your current directory");
  //
  //  QUIT
  //
  else if( ! strcmp( command, "QUIT" ))
  {
    disconnectClient();
    return false;
  }

  ///////////////////////////////////////
  //                                   //
  //    TRANSFER PARAMETER COMMANDS    //
  //                                   //
  ///////////////////////////////////////

  //
  //  MODE - Transfer Mode 
  //
  else if( ! strcmp( command, "STAT" ))
  {
      client.println( "500 Command not recognized");
  }
  else if( ! strcmp( command, "MODE" ))
  {
    if( ! strcmp( parameters, "S" ))
      client.println( "200 S Ok");
    // else if( ! strcmp( parameters, "B" ))
    //  client.println( "200 B Ok\r\n";
    else
      client.println( "504 Only S(tream) is suported");
  }
  //
  //  PASV - Passive Connection management
  //
  else if( ! strcmp( command, "PASV" ))
  {
    if (data.connected()) data.stop();
    //dataServer.begin();
     //dataIp = Ethernet.localIP(); 
    Serial.print("local IP address: ");
    Serial.println(WiFi.localIP());
	Serial.print("SoftAP IP address: ");
    Serial.println(WiFi.softAPIP());
	if(WiFi.localIP().toString()=="0.0.0.0")//JH 17/8/2021, om te kunnen werken met softAP !!!
		 dataIp = WiFi.softAPIP();	
	else dataIp = WiFi.localIP();	  
	//dataIp = WiFi.localIP();	
	dataPort = FTP_DATA_PORT_PASV;
    //data.connect( dataIp, dataPort );
    //data = dataServer.available();
    #ifdef FTP_DEBUG
    Serial.println("Connection management set to passive");
    Serial.println( "Data port set to " + String(dataPort));
    #endif
   client.println( "227 Entering Passive Mode ("+ String(dataIp[0]) + "," + String(dataIp[1])+","+ String(dataIp[2])+","+ String(dataIp[3])+","+String( dataPort >> 8 ) +","+String ( dataPort & 255 )+").");
   dataPassiveConn = true;
  }
  //
  //  PORT - Data Port
  //
  else if( ! strcmp( command, "PORT" ))
  {
	if (data) data.stop();
    // get IP of data client
    dataIp[ 0 ] = atoi( parameters );
    char * p = strchr( parameters, ',' );
    for( uint8_t i = 1; i < 4; i ++ )
    {
      dataIp[ i ] = atoi( ++ p );
      p = strchr( p, ',' );
    }
    // get port of data client
    dataPort = 256 * atoi( ++ p );
    p = strchr( p, ',' );
    dataPort += atoi( ++ p );
    if( p == NULL )
      client.println( "501 Can't interpret parameters");
    else
    {
      
		client.println("200 PORT command successful");
      dataPassiveConn = false;
    }
  }
  //
  //  STRU - File Structure
  //
  else if( ! strcmp( command, "STRU" ))
  {
    if( ! strcmp( parameters, "F" ))
      client.println( "200 F Ok");
    // else if( ! strcmp( parameters, "R" ))
    //  client.println( "200 B Ok\r\n";
    else
      client.println( "504 Only F(ile) is suported");
  }
  //
  //  TYPE - Data Type
  //
  else if( ! strcmp( command, "TYPE" ))
  {
    if( ! strcmp( parameters, "A" ))
      client.println( "200 TYPE is now ASII");
    else if( ! strcmp( parameters, "I" ))
      client.println( "200 TYPE is now 8-bit binary");
    else
      client.println( "504 Unknow TYPE");
  }

  ///////////////////////////////////////
  //                                   //
  //        FTP SERVICE COMMANDS       //
  //                                   //
  ///////////////////////////////////////

  //
  //  ABOR - Abort
  //
  else if( ! strcmp( command, "ABOR" ))
  {
    abortTransfer();
    client.println( "226 Data connection closed");
  }
  //
  //  DELE - Delete a File 
  //
  else if( ! strcmp( command, "DELE" ))
  {
    char path[ FTP_CWD_SIZE ];
    if( strlen( parameters ) == 0 )
      client.println( "501 No file name");
    else if( makePath( path ))
    {
      if( ! SD.exists( path ))
        client.println( "550 File " + String(parameters) + " not found");
      else
      {
        if( SD.remove( path ))
          client.println( "250 Deleted " + String(parameters) );
        else
          client.println( "450 Can't delete " + String(parameters));
      }
    }
  }
  //
  //  LIST - List ***********************************************************************************************************************************************************
  //
  else if( ! strcmp( command, "LIST" ))
  {
    if( ! dataConnect())
      client.println( "425 No data connection");
    else
    {
	  client.println( "150 Accepted data connection");
      uint16_t nm = 0;
//      Dir dir=SD.openDir(cwdName);
      File dir=SD.open(cwdName);
//      if( !SD.exists(cwdName))
     if((!dir)||(!dir.isDirectory()))
        client.println( "550 Can't open directory " + String(cwdName) );
      else
      {
        File file = dir.openNextFile();
        while( file)
        {
    	  String fn, fs, fd;//JH
          fn = file.name();
    	  fn.remove(0, 1);
		  time_t file_date = file.getLastWrite();//changes JH 20/02/2021
      fd = print_time(file_date);//with LIST, local timestamp is used
		  //fd = print_time(file_date-config.timezone*3600);
      		#ifdef FTP_DEBUG
  			  Serial.println("File Name = "+ fn);
      		#endif
          fs = String(file.size());
          if(file.isDirectory()){
			      data.println( fd + "<DIR> " + fn);
            } 
          else {
            data.print("+r,s" + fs + ",\t"+ fn +"\n");//was println without \n
            #ifdef FTP_DEBUG
            Serial.print("+r,s" + fs + ",\t" + fn +"\n");//was println without \n   
            #endif
          }
          nm ++;
          file = dir.openNextFile();
        }
        client.println( "226 " + String(nm) + " matches total");
      }
      data.stop();
	  
