RP6conrad/ESP-GPS-Logger/ESP32FtpServerJH.cpp
    }
	
  }
  //
  //  MLSD - Listing for Machine Processing (see RFC 3659)********************************************************************
  //
  else if( ! strcmp( command, "MLSD" )| ! strcmp( command, "MLST" ))
  {
    if( ! dataConnect())
    {
      client.println( "425 No data connection MLSD");
    }
    else
    {
	    client.println( "150 Accepted data connection");
      uint16_t nm = 0;
//      Dir dir= SD.openDir(cwdName);
      File dir= SD.open(cwdName);
      //char dtStr[ 15 ];
    //  if(!SD.exists(cwdName))
     if((!dir)||(!dir.isDirectory()))
        client.println( "550 Can't open directory " +String(cwdName) );
//        client.println( "550 Can't open directory " +String(parameters) );
      else
      {
      File file = dir.openNextFile();
      while( file)
    		{
    	  String fn,fs,fd;
        fn = file.name();
        time_t file_date = file.getLastWrite();//changes JH 20/02/2021
        //fd = print_time(file_date);
		    fd = print_time(file_date-config.timezone*3600);  //MLSD expect UTC timestamp !!   
    	  fn.remove(0, strlen(cwdName));
        if(fn[0] == '/') fn.remove(0, 1);
        fs = String(file.size());
        if(file.isDirectory()){
			      data.println( "Type=dir;Size=" + fs + ";"+"modify="+ fd +"; " + fn);
            } 
        else {
            data.println( "Type=file;Size=" + fs + ";"+"modify="+ fd +"; " + fn);
            }
          nm ++;
          file = dir.openNextFile();
        }
        client.println( "226-options: -a -l");
        client.println( "226 " + String(nm) + " matches total");
      }
      data.stop();
    }
  }
  //
  //  NLST - Name List 
  //
  else if( ! strcmp( command, "NLST" ))
  {
    if( ! dataConnect())
      client.println( "425 No data connection");
    else
    {
      client.println( "150 Accepted data connection");
      uint16_t nm = 0;
//      Dir dir=SD.openDir(cwdName);
      File dir= SD.open(cwdName);
      if( !SD.exists( cwdName ))
        client.println( "550 Can't open directory " + String(parameters));
      else
      {
          File file = dir.openNextFile();
//        while( dir.next())
        while( file)
        {
//          data.println( dir.fileName());
          data.println( file.name());
          nm ++;
          file = dir.openNextFile();
        }
        client.println( "226 " + String(nm) + " matches total");
      }
      data.stop();
    }
  }
  //
  //  NOOP
  //
  else if( ! strcmp( command, "NOOP" ))
  {
    // dataPort = 0;
    client.println( "200 Zzz...");
  }
  //
  //  RETR - Retrieve
  //
  else if( ! strcmp( command, "RETR" ))
  {
    char path[ FTP_CWD_SIZE ];
    if( strlen( parameters ) == 0 )
      client.println( "501 No file name");
    else if( makePath( path ))
	{
		file = SD.open(path, "r");
      if( !file)
        client.println( "550 File " +String(parameters)+ " not found");
      else if( !file )
        client.println( "450 Can't open " +String(parameters));
      else if( ! dataConnect())
        client.println( "425 No data connection");
      else
      {
        #ifdef FTP_DEBUG
		Serial.println("Sending " + String(parameters));
        #endif
        client.println( "150-Connected to port "+ String(dataPort));
        client.println( "150 " + String(file.size()) + " bytes to download");
        millisBeginTrans = millis();
        bytesTransfered = 0;
        transferStatus = 1;
      }
    }
  }
  //
  //  STOR - Store
  //
  else if( ! strcmp( command, "STOR" ))
  {
    char path[ FTP_CWD_SIZE ];
    if( strlen( parameters ) == 0 )
      client.println( "501 No file name");
    else if( makePath( path ))
    {
		  file = SD.open(path, "w");
      if( !file)
        client.println( "451 Can't open/create " +String(parameters) );
      else if( ! dataConnect())
      {
        client.println( "425 No data connection");
        file.close();
      }
      else
      {
        #ifdef FTP_DEBUG
          Serial.println( "Receiving " +String(parameters));
        #endif
        client.println( "150 Connected to port " + String(dataPort));
        millisBeginTrans = millis();
        bytesTransfered = 0;
        transferStatus = 2;
      }
    }
  }
  //
  //  MKD - Make Directory
  //
  else if( ! strcmp( command, "MKD" ))
  {
    #ifdef FTP_DEBUG
    Serial.print("MKD P=");
    Serial.print(parameters);
    Serial.print(" CWD=");
    Serial.println(cwdName);
    #endif
    String dir;

    if (!strcmp(cwdName,"/")) // avoid "\\newdir"
    {
      dir = String("/") + parameters;
    }
    else
    {
      dir = String(cwdName) +"/" + parameters;
    }

    #ifdef FTP_DEBUG
    Serial.print("try to create  ");
    Serial.println(dir);
    #endif

    fs::FS &fs = SD;
    if (fs.mkdir(dir.c_str()))
    {
      client.println( "257 \"" + String(parameters) + "\" - Directory successfully created");  
    }
    else
    {
	    client.println( "502 Can't create \"" + String(parameters));  
    }
  }
  //
  //  RMD - Remove a Directory 
  //
  else if( ! strcmp( command, "RMD" ))
  {
    #ifdef FTP_DEBUG
    Serial.print("RMD ");
    Serial.print(parameters);
    Serial.print(" CWD=");
    Serial.println(cwdName);
    #endif
    String dir;

    if (!strcmp(cwdName,"/")) // avoid "\\newdir"
    {
      dir = String("/") + parameters;
    }
    else
    {
      dir = String(cwdName) +"/" + parameters;
    }
    fs::FS &fs = SD;
    if (fs.rmdir(dir.c_str()))
    {
      client.println( "250 RMD command successful");  
    }
    else
    {
	    client.println( "502 Can't delete \"" + String(parameters));  //not support on espyet
    }

	
  }
  //
  //  RNFR - Rename From 
  //
  else if( ! strcmp( command, "RNFR" ))
  {
    buf[ 0 ] = 0;
    if( strlen( parameters ) == 0 )
      client.println( "501 No file name");
    else if( makePath( buf ))
    {
      if( ! SD.exists( buf ))
        client.println( "550 File " +String(parameters)+ " not found");
      else
      {
        #ifdef FTP_DEBUG
		  Serial.println("Renaming " + String(buf));
        #endif
        client.println( "350 RNFR accepted - file exists, ready for destination");     
        rnfrCmd = true;
      }
    }
  }
  //
  //  RNTO - Rename To 
  //
  else if( ! strcmp( command, "RNTO" ))
  {  
    char path[ FTP_CWD_SIZE ];
    //char dir[ FTP_FIL_SIZE ];
    if( strlen( buf ) == 0 || ! rnfrCmd )
      client.println( "503 Need RNFR before RNTO");
    else if( strlen( parameters ) == 0 )
      client.println( "501 No file name");
    else if( makePath( path ))
    {
      if( SD.exists( path ))
        client.println( "553 " +String(parameters)+ " already exists");
      else
      {          
            #ifdef FTP_DEBUG
		  Serial.println("Renaming " + String(buf) + " to " + String(path));
            #endif
            if( SD.rename( buf, path ))
              client.println( "250 File successfully renamed or moved");
            else
				client.println( "451 Rename/move failure");
                                 
